configuration/build/idea/classes/iplm/testresources/claimnotify/ClaimNotifyEventRq-Ilu-SAMPLE.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope
  xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
  xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
  xmlns:xh="http://www.xchanging.com/wsdl/ClaimService/"
  xmlns:ns3="http://www.xchanging.com/claimnotify/rq/1"
  xmlns:ns2="http://www.ACORD.org/standards/Jv-Ins-Reinsurance/1"
  xmlns:ns4="http://www.ACORD.org/Standards/AcordMsgSvc/1">
  <soap:Header
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <xh:xchangingheader>
      <xh:Sender>
        <xh:Party>
          <xh:Id>urn:duns:236196817</xh:Id>
        </xh:Party>
      </xh:Sender>
      <xh:Receiver>
        <xh:Party>
          <xh:Id>urn:ilu:402801</xh:Id>
        </xh:Party>
      </xh:Receiver>
      <xh:MsgTypeCd>ClaimNotify</xh:MsgTypeCd>
      <xh:Timestamp>2015-11-28T11:01:26Z</xh:Timestamp>
      <xh:RequestUUId>ce22a0a9-cee6-4922-b14f-36ad5d59465b</xh:RequestUUId>
    </xh:xchangingheader>
    <wsse:Security
      soap:mustUnderstand="1">
      <Signature
        xmlns="http://www.w3.org/2000/09/xmldsig#">
        <SignedInfo>
          <ds:CanonicalizationMethod
            xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
            Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:CanonicalizationMethod>
          <SignatureMethod
            Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
          <Reference
            URI="#Id-56A9B7D1-2F72-40EB-9466-777E55F5438E">
            <Transforms>
              <Transform
                Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
            </Transforms>
            <DigestMethod
              Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
            <DigestValue>cr/KWZzM3tuYwLd9MGpPbYtnSgs=</DigestValue>
          </Reference>
        </SignedInfo>
        <SignatureValue>
          IIK0X/vemdOIhwSQxnH0o/AaVBUFlqhpWc4PhTJSCz20p4X4aYCQ0gOkXjEOIzKxLNBvEOsK/uLhu3WAK469ESfcyRUg2aDJmOiwG8upNDds4dhpdEYSVv5f29s6tt5z4VNB8IDz4NbmmsQmpO9jJxdfwB4Z/PewwbXh06TpisBOBRt7lvFc1moMnDjsexmvJSBgOk1u1NqyuEkfqv8H3KtwfCprv6+L+R2jq0PVjI3axDGqU2ntg9uLKDnR3MFEcGN/MEKU26mvowY4BihxfXBmTphbsiDS8sjVpzEG7bw6gQC7MMdqXQAhDaGdz1P7MZjuamrWU9y9AmneGsX+ww==
        </SignatureValue>
        <KeyInfo>
          <wsse:SecurityTokenReference>
            <ds:X509Data
              xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
              <ds:X509IssuerSerial>
                <ds:X509IssuerName>CN=COMODO RSA Domain Validation Secure Server CA,O=COMODO CA
                  Limited,L=Salford,ST=Greater Manchester,C=GB
                </ds:X509IssuerName>
                <ds:X509SerialNumber>218837913371202335816408030592644071352</ds:X509SerialNumber>
              </ds:X509IssuerSerial>
            </ds:X509Data>
          </wsse:SecurityTokenReference>
        </KeyInfo>
      </Signature>
    </wsse:Security>
  </soap:Header>
  <soap:Body
    wsu:Id="Id-56A9B7D1-2F72-40EB-9466-777E55F5438E">
 <ns3:ClaimNotifyEventRq Sender = "serviceprovider" Receiver = "insurer">
   <ns2:UUId>fec04d74-e890-4d56-9377-931cbf8b650f</ns2:UUId>
   <ns2:CreationDate>2016-11-10T04:41:10+00:00</ns2:CreationDate>
   <ns3:ClaimMovement Sender = "serviceprovider" Receiver = "insurer">
    <ns2:UUId>fec04d74-e890-4d56-9377-931cbf8b650f</ns2:UUId>
    <ns2:ServiceProviderReference>c9434a11-9292-4a8d-bcab-4f5d0259af7a</ns2:ServiceProviderReference>
    <ns2:CreationDate>2016-11-10T04:41:10+00:00</ns2:CreationDate>
    <ns2:Explanation>U</ns2:Explanation>
    <ns2:ClaimAdviceInitialOrSubsequentIndicator>InterimAdviceAndSettlement</ns2:ClaimAdviceInitialOrSubsequentIndicator>
    <ns2:Insurer>
     <ns2:Party>
      <ns2:Id Agency = "ilu">urn:ilu:402801</ns2:Id>
      <ns2:Name>ZURICH INSURANCE PLC</ns2:Name>
     </ns2:Party>
    </ns2:Insurer>
    <ns2:Broker>
     <ns2:Party>
      <ns2:Id Agency = "ilu">urn:ilu:9979</ns2:Id>
      <ns2:Name>TEST BROKER 9979</ns2:Name>
     </ns2:Party>
     <ns2:Contact>
      <ns2:PersonName>MICHELLE PHIPPS</ns2:PersonName>
      <ns2:Telephone>1234</ns2:Telephone>
     </ns2:Contact>
    </ns2:Broker>
    <ns2:ServiceProvider>
     <ns2:Party>
      <ns2:Id Agency = "DUNS_dun_and_bradstreet">urn:duns:236196817</ns2:Id>
      <ns2:Name>Xchanging</ns2:Name>
     </ns2:Party>
    </ns2:ServiceProvider>
    <ns2:Insured>
     <ns2:Party>
      <ns2:Name>PT AUTO LTD</ns2:Name>
     </ns2:Party>
    </ns2:Insured>
    <ns2:BureauLeadingInsurerOrReinsurer>
     <ns2:Party>
      <ns2:Name>ZURICH INSURANCE PLC</ns2:Name>
     </ns2:Party>
     <ns2:Contact>
      <ns2:PersonName>TEST</ns2:PersonName>
      <ns2:Telephone>223</ns2:Telephone>
      <ns2:Email>CASEY.ABRAHAMSE@XCHANGING.COM</ns2:Email>
     </ns2:Contact>
    </ns2:BureauLeadingInsurerOrReinsurer>
    <ns2:Contract>
     <ns2:BrokerReference>B9979ECF2WB5002</ns2:BrokerReference>
     <ns2:InsurerRiskReference>23-502012</ns2:InsurerRiskReference>
    </ns2:Contract>
    <ns2:ClaimEntry>
     <ns2:BrokerReference>B9979002</ns2:BrokerReference>
    </ns2:ClaimEntry>
    <ns2:Claim>
     <ns2:LossOrEventName>SC8A TR2</ns2:LossOrEventName>
     <ns2:BrokerReference>B9979ECF2WBSC8AG</ns2:BrokerReference>
    </ns2:Claim>
    <ns2:ClaimOriginalPolicy>
     <ns2:JvClassOfBusiness>AH</ns2:JvClassOfBusiness>
    </ns2:ClaimOriginalPolicy>
    <ns3:MessageSequenceNumber>127</ns3:MessageSequenceNumber>
    <ns3:AsOfDate>2016-11-10T04:40:24.355Z</ns3:AsOfDate>
    <ns3:ActionParticipantType>X</ns3:ActionParticipantType>
    <ns3:ActionParticipant>SYSTEM</ns3:ActionParticipant>
    <ns3:ResponseCode>SGN</ns3:ResponseCode>
    <ns3:Reinsured>
     <ns2:Party>
      <ns2:Name>MP CAR REPAIR</ns2:Name>
     </ns2:Party>
    </ns3:Reinsured>
    <ns3:PlacingBroker>
     <ns2:Party>
      <ns2:Name>-</ns2:Name>
     </ns2:Party>
     <ns3:Description>-</ns3:Description>
    </ns3:PlacingBroker>
    <ns3:ContractSection>
     <ns2:InsuredRiskOrInterestDescription>UMR003 - GUIDEWIRE</ns2:InsuredRiskOrInterestDescription>
     <ns2:ContractPeriod>
      <ns2:StartDate>2016-01-01</ns2:StartDate>
      <ns2:EndDate>2016-12-31</ns2:EndDate>
     </ns2:ContractPeriod>
     <ns2:ContractPeriodDescription>LST</ns2:ContractPeriodDescription>
     <ns2:InsurerSharePercentage>
      <ns2:Rate RateUnit = "Percentage">100.0000000</ns2:Rate>
     </ns2:InsurerSharePercentage>
    </ns3:ContractSection>
    <ns3:LossDetails>SC8A TR2</ns3:LossDetails>
    <ns3:ClaimAmounts Ccy = "GBP">
     <ns2:ClaimMovementAmtItem Type = "loss_and_expense_incurred_for_contract_before_retention">
      <ns2:Amt Ccy = "GBP" Share = "hundred_percent" CcyIndic = "reference_currency">27000.00</ns2:Amt>
     </ns2:ClaimMovementAmtItem>
     <ns2:ClaimMovementAmtItem Type = "outstanding_loss_plus_expense_for_contract_before_retention">
      <ns2:Amt Ccy = "GBP" Share = "hundred_percent" CcyIndic = "reference_currency">6000.00</ns2:Amt>
     </ns2:ClaimMovementAmtItem>
     <ns2:ClaimMovementAmtItem Type = "100_percent_losses_and_expenses_paid_for_contract_before_retention">
      <ns2:Amt Ccy = "GBP" Share = "hundred_percent" CcyIndic = "reference_currency">6000.00</ns2:Amt>
     </ns2:ClaimMovementAmtItem>
     <ns2:ClaimMovementAmtItem Type = "current_payment_losses_and_expenses_for_contract">
      <ns2:Amt Ccy = "GBP" Share = "hundred_percent" CcyIndic = "reference_currency">15000.00</ns2:Amt>
     </ns2:ClaimMovementAmtItem>
     <ns2:ClaimMovementAmtItem Type = "current_payment_losses_for_the_contract">
      <ns2:Amt Ccy = "GBP" Share = "hundred_percent" CcyIndic = "reference_currency">15000.00</ns2:Amt>
     </ns2:ClaimMovementAmtItem>
     <ns2:ClaimMovementAmtItem Type = "professional_advisor_fees_outstanding">
      <ns2:Amt Ccy = "GBP" Share = "hundred_percent" CcyIndic = "reference_currency">0.00</ns2:Amt>
     </ns2:ClaimMovementAmtItem>
     <ns2:ClaimMovementAmtItem Type = "professional_advisor_fees_current_payment">
      <ns2:Amt Ccy = "GBP" Share = "hundred_percent" CcyIndic = "reference_currency">0.00</ns2:Amt>
     </ns2:ClaimMovementAmtItem>
    </ns3:ClaimAmounts>
    <ns3:Extension>
     <ns3:Contract>
      <ns2:RiskLocation>
       <ns2:Location>
        <ns2:Description>WW</ns2:Description>
       </ns2:Location>
      </ns2:RiskLocation>
      <ns3:SlipLeadName>
       <ns2:Party>
        <ns2:Name>ZURICH INSURANCE PLC</ns2:Name>
       </ns2:Party>
      </ns3:SlipLeadName>
      <ns3:ContractMarket Agency = "ilu">
       <ns3:InsurerOrReinsurer>
        <ns2:Party>
         <ns2:Id Agency = "ilu">urn:ilu:402801</ns2:Id>
         <ns2:Name>Zurich 402801</ns2:Name>
        </ns2:Party>
        <ns2:Contact>
         <ns2:PersonName>TEST</ns2:PersonName>
         <ns2:Telephone>223</ns2:Telephone>
         <ns2:Email>CASEY.ABRAHAMSE@XCHANGING.COM</ns2:Email>
        </ns2:Contact>
        <ns3:MarketFinancialAmounts Ccy = "GBP">
         <ns3:IncludedInSettlementIndicator>Y</ns3:IncludedInSettlementIndicator>
         <ns2:ClaimMovementAmtItem Type = "Cash_Settlement_Amount">
          <ns2:Amt Ccy = "target_currency" Share = "hundred_percent">15000.00</ns2:Amt>
         </ns2:ClaimMovementAmtItem>
         <ns2:ClaimMovementAmtItem Type = "Letter_Of_Credit_Amount">
          <ns2:Amt Ccy = "target_currency" Share = "hundred_percent">0.00</ns2:Amt>
         </ns2:ClaimMovementAmtItem>
         <ns3:ClaimSettlementSigningNumber>CLC160050020911</ns3:ClaimSettlementSigningNumber>
        </ns3:MarketFinancialAmounts>
        <ns2:InsurerSharePercentage>
         <ns2:Rate RateUnit = "Percentage">80.0000000</ns2:Rate>
        </ns2:InsurerSharePercentage>
        <ns3:InsurerOrReinsurerClaimReference1>ZURECF2WB003</ns3:InsurerOrReinsurerClaimReference1>
        <ns3:ParticipantFunction>Lead</ns3:ParticipantFunction>
        <ns3:ClaimLineNumber>1</ns3:ClaimLineNumber>
       </ns3:InsurerOrReinsurer>
       <ns3:InsurerOrReinsurer>
        <ns2:Party>
         <ns2:Id Agency = "ilu">urn:ilu:402802</ns2:Id>
         <ns2:Name>Zurich 402802</ns2:Name>
        </ns2:Party>
        <ns2:Contact>
         <ns2:PersonName>TEST</ns2:PersonName>
         <ns2:Telephone>223</ns2:Telephone>
         <ns2:Email>CASEY.ABRAHAMSE@XCHANGING.COM</ns2:Email>
        </ns2:Contact>
        <ns3:MarketFinancialAmounts Ccy = "GBP">
         <ns3:IncludedInSettlementIndicator>Y</ns3:IncludedInSettlementIndicator>
         <ns2:ClaimMovementAmtItem Type = "Cash_Settlement_Amount">
          <ns2:Amt Ccy = "target_currency" Share = "hundred_percent">15000.00</ns2:Amt>
         </ns2:ClaimMovementAmtItem>
         <ns2:ClaimMovementAmtItem Type = "Letter_Of_Credit_Amount">
          <ns2:Amt Ccy = "target_currency" Share = "hundred_percent">0.00</ns2:Amt>
         </ns2:ClaimMovementAmtItem>
         <ns3:ClaimSettlementSigningNumber>CLC160050020911</ns3:ClaimSettlementSigningNumber>
        </ns3:MarketFinancialAmounts>
        <ns2:InsurerSharePercentage>
         <ns2:Rate RateUnit = "Percentage">10.0000000</ns2:Rate>
        </ns2:InsurerSharePercentage>
        <ns3:InsurerOrReinsurerClaimReference1>ZURECF2WB003</ns3:InsurerOrReinsurerClaimReference1>
        <ns3:ParticipantFunction>Agreement Party</ns3:ParticipantFunction>
        <ns3:ClaimLineNumber>1</ns3:ClaimLineNumber>
       </ns3:InsurerOrReinsurer>
       <ns3:InsurerOrReinsurer>
        <ns2:Party>
         <ns2:Id Agency = "ilu">urn:ilu:GW2001</ns2:Id>
         <ns2:Name>Insurer GW2001</ns2:Name>
        </ns2:Party>
        <ns2:Contact>
         <ns2:PersonName>TEST</ns2:PersonName>
         <ns2:Telephone>223</ns2:Telephone>
         <ns2:Email>CASEY.ABRAHAMSE@XCHANGING.COM</ns2:Email>
        </ns2:Contact>
        <ns3:MarketFinancialAmounts Ccy = "GBP">
         <ns3:IncludedInSettlementIndicator>Y</ns3:IncludedInSettlementIndicator>
         <ns2:ClaimMovementAmtItem Type = "Cash_Settlement_Amount">
          <ns2:Amt Ccy = "target_currency" Share = "hundred_percent">15000.00</ns2:Amt>
         </ns2:ClaimMovementAmtItem>
         <ns2:ClaimMovementAmtItem Type = "Letter_Of_Credit_Amount">
          <ns2:Amt Ccy = "target_currency" Share = "hundred_percent">0.00</ns2:Amt>
         </ns2:ClaimMovementAmtItem>
         <ns3:ClaimSettlementSigningNumber>CLC160050020911</ns3:ClaimSettlementSigningNumber>
        </ns3:MarketFinancialAmounts>
        <ns2:InsurerSharePercentage>
         <ns2:Rate RateUnit = "Percentage">10.0000000</ns2:Rate>
        </ns2:InsurerSharePercentage>
        <ns3:InsurerOrReinsurerClaimReference1>ZURECF2WB003</ns3:InsurerOrReinsurerClaimReference1>
        <ns3:ParticipantFunction>Agreement Party</ns3:ParticipantFunction>
        <ns3:ClaimLineNumber>1</ns3:ClaimLineNumber>
       </ns3:InsurerOrReinsurer>
      </ns3:ContractMarket>
      <ns3:SlipOrder1>100.0000000</ns3:SlipOrder1>
      <ns3:SlipOrder2>100.0000000</ns3:SlipOrder2>
      <ns3:ContractCoverage CoverageType = "EEL">
       <ns3:CoverageAmount>
        <ns2:Amt Ccy = "GBP" Share = "hundred_percent" CcyIndic = "reference_currency">15000000.00</ns2:Amt>
       </ns3:CoverageAmount>
      </ns3:ContractCoverage>
      <ns3:ContractValueInterest>
       <ns3:ValueInterestAmount>
        <ns2:Amt Ccy = "GBP" Share = "hundred_percent" CcyIndic = "reference_currency">0.00</ns2:Amt>
       </ns3:ValueInterestAmount>
      </ns3:ContractValueInterest>
      <ns3:ContractDeductible>
       <ns3:DeductibleAmount>
        <ns2:Amt Ccy = "GBP" Share = "hundred_percent" CcyIndic = "reference_currency">5000000.00</ns2:Amt>
       </ns3:DeductibleAmount>
      </ns3:ContractDeductible>
     </ns3:Contract>
     <ns3:Claim>
      <ns3:ClaimLineNumber>1</ns3:ClaimLineNumber>
      <ns3:ClaimStatus>Open</ns3:ClaimStatus>
      <ns3:LossPeriod>
       <ns3:LossDateQualifier>L</ns3:LossDateQualifier>
       <ns3:StartDate>2016-04-01</ns3:StartDate>
      </ns3:LossPeriod>
      <ns3:ClaimType>000</ns3:ClaimType>
      <ns3:ECFIndicator>Y</ns3:ECFIndicator>
      <ns3:Indicators>
       <ns3:ConflictOfInterestIndicator>N</ns3:ConflictOfInterestIndicator>
       <ns3:ChaseUpIndicator>
        <ns3:Indicator>N</ns3:Indicator>
       </ns3:ChaseUpIndicator>
       <ns3:CedantInLiquidationIndicator>N</ns3:CedantInLiquidationIndicator>
       <ns3:SimultaneousReinstatementRequired>N</ns3:SimultaneousReinstatementRequired>
       <ns3:SimultaneousReinstatementProcessed>N</ns3:SimultaneousReinstatementProcessed>
       <ns3:WarIndicator>N</ns3:WarIndicator>
      </ns3:Indicators>
     </ns3:Claim>
     <ns3:ClaimEntry>
      <ns3:TransactionSequence>002</ns3:TransactionSequence>
      <ns3:IluStatus>40-COMPLETE</ns3:IluStatus>
      <ns3:AddedCirculatedOrAuthorisedDate>2016-10-21</ns3:AddedCirculatedOrAuthorisedDate>
      <ns3:Comments>
       <ns3:Broker>
        <ns3:LineNumber>1</ns3:LineNumber>
        <ns3:CommentDetails>RE-RELEASE (WBNO-30)</ns3:CommentDetails>
       </ns3:Broker>
       <ns3:PublicComments>
        <ns3:Comment>
         <ns3:LineNumber>1</ns3:LineNumber>
         <ns3:CommentDetails>script-8a-step-52</ns3:CommentDetails>
        </ns3:Comment>
       </ns3:PublicComments>
       <ns3:CrossMarketComments PrivateCommentIndicator = "N">
        <ns3:Bureau Agency = "ilu">
         <ns3:Claim>
          <ns2:BrokerReference>B9979ECF2WBSC8AG</ns2:BrokerReference>
          <ns3:TransactionReference>B9979002</ns3:TransactionReference>
          <ns2:CreationDate>2016-10-21T12:16:16+01:00</ns2:CreationDate>
          <ns3:Syndicate Name = "ZURICH">
           <ns3:Comment>
            <ns3:LineNumber>1</ns3:LineNumber>
            <ns3:CommentDetails>script-8a-step-52</ns3:CommentDetails>
           </ns3:Comment>
           <ns3:Response>AUT</ns3:Response>
          </ns3:Syndicate>
         </ns3:Claim>
        </ns3:Bureau>
       </ns3:CrossMarketComments>
      </ns3:Comments>
      <ns3:ClaimEntryFinancialAmounts Ccy = "GBP">
       <ns3:ServiceProviderOriginalSplitReference>PMC160050060510</ns3:ServiceProviderOriginalSplitReference>
       <ns2:ClaimMovementAmtItem Type = "Reserve_Released_Amount">
        <ns2:Amt Ccy = "GBP" Share = "hundred_percent" CcyIndic = "reference_currency">0.00</ns2:Amt>
       </ns2:ClaimMovementAmtItem>
       <ns2:ClaimMovementAmtItem Type = "Reserve_Retained_Amount">
        <ns2:Amt Ccy = "GBP" Share = "hundred_percent" CcyIndic = "reference_currency">0.00</ns2:Amt>
       </ns2:ClaimMovementAmtItem>
       <ns2:ClaimMovementAmtItem Type = "Interest_On_Reserve_Amount">
        <ns2:Amt Ccy = "GBP" Share = "hundred_percent" CcyIndic = "reference_currency">0.00</ns2:Amt>
       </ns2:ClaimMovementAmtItem>
       <ns2:ClaimMovementAmtItem Type = "Tax_On_Interest_Amount">
        <ns2:Amt Ccy = "GBP" Share = "hundred_percent" CcyIndic = "reference_currency">0.00</ns2:Amt>
       </ns2:ClaimMovementAmtItem>
       <ns2:ClaimMovementAmtItem Type = "Imported_Services_Amount">
        <ns2:Amt Ccy = "GBP" Share = "hundred_percent" CcyIndic = "reference_currency">0.00</ns2:Amt>
       </ns2:ClaimMovementAmtItem>
       <ns2:ClaimMovementAmtItem Type = "Letter_Of_Credit_Amount">
        <ns2:Amt Ccy = "GBP" Share = "hundred_percent" CcyIndic = "reference_currency">0.00</ns2:Amt>
       </ns2:ClaimMovementAmtItem>
       <ns2:ClaimMovementAmtItem Type = "Vat_Amount">
        <ns2:Amt Ccy = "GBP" Share = "hundred_percent" CcyIndic = "reference_currency">0.00</ns2:Amt>
       </ns2:ClaimMovementAmtItem>
       <ns3:TargetCurrency>
        <ns2:Ccy>GBP</ns2:Ccy>
       </ns3:TargetCurrency>
       <ns3:SettlementAmount>15000.00</ns3:SettlementAmount>
       <ns3:ExchangeRate>1.00000</ns3:ExchangeRate>
      </ns3:ClaimEntryFinancialAmounts>
     </ns3:ClaimEntry>
    </ns3:Extension>
   </ns3:ClaimMovement>
   <ns3:SupportingDocument>
    <ns4:DocumentId>5d568b23-c3dd-41c9-b047-c0b284aae58f</ns4:DocumentId>
    <ns4:DocumentVersion>1.0</ns4:DocumentVersion>
    <ns4:DocumentVersionDtTime>2016-10-12T01:00:00+01:00</ns4:DocumentVersionDtTime>
    <ns4:FileId>20161012mp tr2Reinsurer Status Request</ns4:FileId>
    <ns4:FileFormatCd>application/msword</ns4:FileFormatCd>
    <ns4:FileSize>
     <ns4:NumUnits>331</ns4:NumUnits>
     <ns4:UnitMeasurementCd>KB</ns4:UnitMeasurementCd>
    </ns4:FileSize>
    <ns4:DocumentTypeCd>inquiry_status_request_reinsurer</ns4:DocumentTypeCd>
    <ns4:Description>tr2</ns4:Description>
    <ns4:FolderReference>Claim Related Documents</ns4:FolderReference>
    <ns3:ReferredObjects>
     <ns2:ServiceProvider>
      <ns2:Party>
       <ns2:Name>Xchanging</ns2:Name>
      </ns2:Party>
     </ns2:ServiceProvider>
     <ns3:Contract>
      <ns2:BrokerReference>B9979ECF2WB5002</ns2:BrokerReference>
     </ns3:Contract>
     <ns3:Claim>
      <ns2:BrokerReference>B9979ECF2WBSC8AG</ns2:BrokerReference>
     </ns3:Claim>
     <ns3:ClaimEntry>
      <ns2:BrokerReference>B9979002</ns2:BrokerReference>
     </ns3:ClaimEntry>
    </ns3:ReferredObjects>
   </ns3:SupportingDocument>
   <ns3:SupportingDocument>
    <ns4:DocumentId>c38c3317-f415-4da9-b07d-d45d2bac70b2</ns4:DocumentId>
    <ns4:DocumentVersion>1.0</ns4:DocumentVersion>
    <ns4:DocumentVersionDtTime>2016-10-04T13:25:45+01:00</ns4:DocumentVersionDtTime>
    <ns4:FileId>Slip</ns4:FileId>
    <ns4:FileFormatCd>application/vnd.openxmlformats-officedocument.wordprocessingml.document</ns4:FileFormatCd>
    <ns4:FileSize>
     <ns4:NumUnits>12</ns4:NumUnits>
     <ns4:UnitMeasurementCd>KB</ns4:UnitMeasurementCd>
    </ns4:FileSize>
    <ns4:DocumentTypeCd>document_slip</ns4:DocumentTypeCd>
    <ns4:FolderReference>Slip Documents</ns4:FolderReference>
    <ns3:ReferredObjects>
     <ns3:Contract>
      <ns2:BrokerReference>B9979ECF2WB5002</ns2:BrokerReference>
     </ns3:Contract>
    </ns3:ReferredObjects>
   </ns3:SupportingDocument>
  </ns3:ClaimNotifyEventRq>
  </soap:Body>
</soap:Envelope>